# ЗАВДАННЯ 1

# Вивести на екран усі прості числа в діапазоні, зазначеному користувачем.
# Число називається простим, якщо воно ділиться без залишку тільки на себе та на одиницю.
# Наприклад, три — це просте число, а чотири — ні.

start = int(input("Введіть початкове число діапазону: "))
end = int(input("Введіть кінцеве число діапазону: "))


def getNumbers(start, end):


i = 2
while i < getNumbers():
    if getNumbers() % i == 0:
        simple = False
    i += 1
if simple:
    print("Прості числа у заданому діапазоні:")
